type acronymType = {
  [key: string]: string;
};

const harav: acronymType = {
  "א'": 'אורות, ירושלים, תשכ"ג',
  'א"א': 'אורות האמונה, ירושלים, תשנ"ח',
  'א"ב': "אפיקים בנגב",
  "אג'": "אגרות הראיה",
  'א"ה': "אוצרות הראיה",
  'או"ה': 'אורות הראיה, ירושלים, תש"ל',
  'א"י': 'אדר היקר, ירושלים, תשכ"ג',
  'א"ק': "אורות הקודש",
  'א"ש': 'אורות התשובה, אור עציון, תש"ל',
  'א"ת': 'אורות התורה, ירושלים, תשל"ג',
  'א"ת ב': 'אורות התורה, מהדורת הרב אבינר, ירושלים, תשס"ו',
  'ב"ר': 'בשמן רענן, חלק א, ירושלים, תש"ן',
  'ג"ר':
    'חוברת גנזי ראיה, מהדורה שניה מאגדת לסדרה של שש חוברות שיצאו במהדורה הראשונה, תש"ן',
  "ה'": 'הגדה של פסח, ירושלים, תשנ"ד',
  'ה"ה': 'המחשבה הישראלית, ירושלים, תר"ף',
  "חד'": 'חדריו, מהדורה ראשונה, תשנ"ח',
  'ח"ה': 'חזון הגאולה, ירושלים, תש"א',
  'ח"פ': 'חבש פאר, ירושלים, תשל"ג',
  'ט"ר': 'טוב ראיה, ירושלים, תשמ"ו',
  "לא'": 'לאורו, אורות הרמב"ם, ירושלים, תשנ"ה',
  'ל"ה': 'לנבוכי הדור, ישראל, תשע"ד',
  "מ'": 'חוברת מאור, ירושלים, תשמ"ד',
  'מ"א': 'מוסר אביך, ירושלים, תשל"א',
  'מא"ה א': 'מאורות הראי"ה, ירח האיתנים, ירושלים, ער"ה תשנ"ה',
  'מא"ה ב': 'מאורות הראי"ה, לשבועות, ירושלים, תשנ"ד',
  'מא"ה ג': 'מאורות הראי"ה, לחנוכה ארבע פרשיות ופורים, ירושלים, תשנ"ה',
  'מא"ה ד': 'מאורות הראי"ה, לשבת, ירושלים, תשע"ג',
  'מ"ה': 'מדות הראיה, ירושלים, תשל"א',
  'מצ"ר': 'מצות ראיה, ירושלים, תשמ"ה',
  'מ"ר': 'מאמרי הראיה, ירושלים, תש"מ',
  'מ"ש': 'מדבר שור, ירושלים, תשנ"ט',
  'נ"א': "ניצני ארץ, סדרת חוברות, ירושלים",
  'ע"א': "עין איה",
  'ע"ה': 'עקבי הצאן, ירושלים, תשכ"ג',
  'ע"ט': 'ערפלי טוהר, ירושלים, תשמ"ג',
  'ע"ס': 'עטור סופרים, ירושלים, תשל"ד',
  'ע"ר': 'עולת ראיה, ירושלים, תשכ"ג',
  'פ"א': 'ביאורי הראי"ה לפרקי אבות, ירושלים תשס"ו',
  "פנ'": 'פנקס י"ג, ירושלים, התשס"ד (בציון המקורות צוינו הסימנים ולא העמודים)',
  "פנק'": 'פנקסי הראי"ה',
  "קבצ'": 'קבצים מכת"י קדשו',
  'ר"מ': 'ראש מילין, תשס"ג',
  'ש"ה': 'שבת הארץ, ירושלים, תרצ"ז',
  'ש"ק':
    'שמונה קבצים, ירושלים, תשנ"ט (בציון המקורות צוינו הקבצים והסימנים ולא העמודים)',
};

const ratzia: acronymType = {
  'א"ל': 'אור לנתיבתי, ירושלים, תשמ"ט',
  'ב"א': "באורים לאורות התשובה",
  'ל"י': "לנתיבות ישראל",
  'מה"ה': "מתוך התורה הגואלת",
  'נ"ה': 'נפש הראיה, ירושלים, תשס"ג',
  "פע'": "פעמים, ירושלים, הוצאת גלי מסכתא",
  'צ"צ': 'צמח צבי, ירושלים, תשנ"א',
  'ק"ת': "קנין תורה, מהד' רקובר, תשמ\"ב",
  "שי'":
    "שיחות הרצי\"ה (בציון המקורות לחוברות, המס' הראשון מציין את מס' החוברת והשני את העמ')",
  "שי' מועדים": 'שיחות הרצי"ה למועדים',
  "שי' ת\"ת": 'שיחות הרצי"ה תלמוד תורה, ירושלים כסלו תש"ע',
};

const hanazir: acronymType = {
  'ד"ל':
    'דודי לצבי, חוברת, ירושלים, תשל"ה. קבוצת מכתבים ואגרות מאת הרד"ך אל הרצי"ה',
  'ח"ר': 'חוברת חוג הראי"ה, ירושלים, תשמ"ח',
  'פ"ה': 'פתחי הפרדס, ביאורי קל"ח פתחי חכמה, לרמח"ל. ירושלים, ה\'תשס"ט',
  'ק"ה': 'קול הנבואה, ירושלים, תשל"ט',
  'ק"ו': 'קול ואור, ירושלים, תשמ"ז',
  "ש' רד\"ך": 'שעורי רד"ך באורות הקודש, ע"י הרב אהרן מונדשיין, ירושלים תשע"א',
};

const sources: acronymType[] = [harav, ratzia, hanazir];

const keys = sources.flatMap(Object.keys).sort((a, b) => b.length - a.length);

export const getSource = (value: string): string => {
  const replacements: string[] = [];
  const matchedKeys: string[] = [];

  for (const key of keys) {
    if (
      value.includes(key) &&
      !matchedKeys.some((matchedKey) => matchedKey.includes(key))
    ) {
      for (const source of sources) {
        if (key in source) {
          replacements.push(source[key]);
          matchedKeys.push(key);
          break;
        }
      }
    }
  }

  // TODO maybe return also whether it's harav, ratzia, or hanazir; and display it (font? italic? size?)
  return replacements.length > 0 ? replacements.join(" ; ") : "";
};
